--------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Barr_James\OneDrive\coding for economists\final_assi
> gnment\log_files/fatal-police-killings-wapo_filtering.log
  log type:  text
 opened on:   9 Nov 2025, 17:58:00

. 
. capture mkdir "cleaned_data/filtering_section3" // creating folder for c
> leaned data that had observations and variables filtered when cleaning

. 
. use "cleaned_data/police-killings-wapo_transformed_section1.dta", clear 
> // Using cleaned data cleaned with Section 1

. 
. drop if race == . // droppping observations with missing data for race
(1,201 observations deleted)

. 
. drop if armed_with == . 
(324 observations deleted)

. 
. drop if flee_status == . 
(1,172 observations deleted)

. 
. drop agency_ids // Dropping agency_ids variable

. 
. drop body_camera

. 
. drop race_source

. 
. drop race_string gender_string armed_with_string flee_status_string thre
> at_type_string // Dropping all string variables no longer needed

. 
. export delimited "cleaned_data/filtering_section3/police-killings-wapo_f
> iltering_section3.csv", replace // exporting as a separate cleaned data 
> set to a folder for section 3, housed within th folder "cleaned_data"
file cleaned_data/filtering_section3/police-killings-wapo_filtering_sectio
> n3.csv saved

. 
. save "cleaned_data/filtering_section3/police-killings-wapo_filtering_sec
> tion3.dta", replace // save as both .csv and .dta
file
    cleaned_data/filtering_section3/police-killings-wapo_filtering_secti
    > on3.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Barr_James\OneDrive\coding for economists\final_assi
> gnment\log_files/fatal-police-killings-wapo_filtering.log
  log type:  text
 closed on:   9 Nov 2025, 17:58:01
--------------------------------------------------------------------------
